CSI API ETABS v1
cPropFrame.SetSDSection Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSDSection(
	string Name,
	string MatProp,
	int DesignType = 0,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetSDSection (
	Name As String,
	MatProp As String,
	Optional DesignType As Integer = 0,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim DesignType As Integer
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetSDSection(Name,
	MatProp, DesignType, Color, Notes,
	GUID)
int SetSDSection(
	String^ Name,
	String^ MatProp,
	int DesignType = 0,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetSDSection :
        Name : string *
        MatProp : string *
        ?DesignType : int *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _DesignType = defaultArg DesignType 0
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
MatProp
Type: System.String
DesignType (Optional)
Type: System.Int32
Color (Optional)
Type: System.Int32
Notes (Optional)
Type: System.String
GUID (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace